pnt325/efr32_mesh/btmesh_soc_vendor_server/sl_btmesh_data_logging_server.c
/***************************************************************************//**
* @file sl_btmesh_data_logging_server.c
* @brief BT Mesh Data Logging Server Instances
*******************************************************************************
* # License
* <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
*******************************************************************************
*
* SPDX-License-Identifier: Zlib
*
* The licensor of this software is Silicon Laboratories Inc.
*
* This software is provided \'as-is\', without any express or implied
* warranty. In no event will the authors be held liable for any damages
* arising from the use of this software.
*
* Permission is granted to anyone to use this software for any purpose,
* including commercial applications, and to alter it and redistribute it
* freely, subject to the following restrictions:
*
* 1. The origin of this software must not be misrepresented; you must not
*    claim that you wrote the original software. If you use this software
*    in a product, an acknowledgment in the product documentation would be
*    appreciated but is not required.
* 2. Altered source versions must be plainly marked as such, and must not be
*    misrepresented as being the original software.
* 3. This notice may not be removed or altered from any source distribution.
*
*******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

#include "app_assert.h"
#include "sl_sleeptimer.h"
#include "app_log.h"
#include "sl_btmesh_data_logging_server.h"

#include "nvm3.h"
#include "nvm3_hal_flash.h"

/***************************************************************************//**
 *
 * Macros
 *
 ******************************************************************************/
#define SLI_BTMESH_NVM3_DATA_LOG_PROP_KEY   0

/***************************************************************************//**
 *
 * Internal functions prototype
 *
 ******************************************************************************/
/// Send data with length in the range of the BTMesh stack limitation
static sl_status_t sli_btmesh_data_log_send(sl_data_frame_t *frame,
                                     sl_data_log_length_t len);

/// Handle data transmission
static sl_status_t sli_btmesh_data_log_send_handler(void);

/// Timeout timer callback
static void sli_btmesh_data_log_timeout_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data);

/// Sample timer callback
static void sli_btmesh_data_log_sample_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data);

/// Periodic timer callback
static void sli_btmesh_data_log_periodic_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data);

/// Update log period timing
static sl_status_t sli_btmesh_data_log_update_period(
                sl_btmesh_evt_vendor_model_receive_t *evt);

/// Update log sample rate timing
static sl_status_t sli_btmesh_data_log_update_sample_rate(
                sl_btmesh_evt_vendor_model_receive_t *evt);

/// Update log raw value
static sl_status_t sli_btmesh_data_log_update_threshold(
                sl_btmesh_evt_vendor_model_receive_t *evt);

/// Save period to NVM
static sl_status_t data_log_save_period(sl_btmesh_data_log_period_t period);

/// Save sample rate to NVM
static sl_status_t data_log_save_sample_rate(
                      sl_btmesh_data_log_sample_rate_t rate);

/// Save threshold to NVM
static sl_status_t data_log_save_threshold(
                      sl_btmesh_data_log_threshold_t threshold);

/// Read period stored in NVM
static sl_status_t data_log_read_period(sl_btmesh_data_log_period_t *period);

/// Read sample rate stored in NVM
static sl_status_t data_log_read_sample_rate(
                      sl_btmesh_data_log_sample_rate_t *rate);

/// Read threshold stored in NVM
static sl_status_t data_log_read_threshold(
                      sl_btmesh_data_log_threshold_t *threshold);

/// Check for the valid storage object
static bool is_storage_valid(void);

/// Read the properties structure from the NVM.
__STATIC_INLINE Ecode_t data_log_read_properties(
                      sl_btmesh_data_log_properties_t *properties);

/// Write the properties structure from the NVM.
__STATIC_INLINE Ecode_t data_log_write_properties(
                      sl_btmesh_data_log_properties_t *properties);

/***************************************************************************//**
 *
 * Global variables
 *
 ******************************************************************************/
/// Data logging buffer
static sl_data_log_data_t sli_data_log_arr[SL_BTMESH_DATA_LOG_BUFF_SIZE_CFG_VAL];

/// Data logging instance
static sl_data_log_t sli_data_log_inst = {
  .index = 0,
  .data = sli_data_log_arr
};

/// Counter for the log transmission
static uint16_t sli_send_count;
/// Position of sending data
static sl_data_log_index_t sli_send_index;
/// Counter for the log transmission
static uint8_t sli_send_status;
/// The Log status
static bool sli_log_started;
/// Start to send log
static bool is_sending_started;
/// Transmit counter
static uint8_t trans_count;

/// Timer for sending timeout
static sl_sleeptimer_timer_handle_t sli_data_log_timeout_timer;
/// Timer for the log sample
static sl_sleeptimer_timer_handle_t sli_data_log_sample_timer;
/// Timer for the log report
static sl_sleeptimer_timer_handle_t sli_data_log_periodic_timer;

/***************************************************************************//**
 *
 * Functions implementation
 *
 ******************************************************************************/
/***************************************************************************//**
 * Initialize the data log server.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_server_init(void)
{
  sl_status_t st;
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  sli_log_started = false;
  is_sending_started = false;
  //Init vendor model
  st = sl_btmesh_vendor_model_init(SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                                   SL_BTMESH_VENDOR_ID,
                                   SL_BTMESH_DATA_LOG_MODEL_SERVER_ID,
                                   SL_BTMESH_MODEL_PUBLISH,
                                   SL_BTMESH_DATA_LOG_OPCODE_LENGTH,
                                   sl_btmesh_data_log_opcodes);

  if(SL_STATUS_OK == st){
    // Clear log
    sli_data_log_inst.index = SL_BTMESH_DATA_LOG_RESET_VAL;
    memset(sli_data_log_inst.data,
           SL_BTMESH_DATA_LOG_CLEAR_VAL,
           SL_BTMESH_DATA_LOG_BUFF_SIZE_CFG_VAL*sizeof(sl_data_log_data_t));
  } else {
      return st;
  }

  // Init NVM too store configuration data
  if(!is_storage_valid()){
      // Init with default values
      properties.period = SL_BTMESH_DATA_LOG_PERIOD_MS_CFG_VAL;
      properties.sample_rate = SL_BTMESH_DATA_LOG_SAMPLE_RATE_MS_CFG_VAL;
      properties.threshold = SL_BTMESH_DATA_LOG_THESHOLD_CFG_VAL;
      ec = data_log_write_properties(&properties);
      app_assert(ec == ECODE_NVM3_OK,
                "[E: 0x%08x] Failed to create NVM storage\n",
                (int)ec);
  }

  // Reset transmission counter
  sli_send_count = SL_BTMESH_DATA_LOG_RESET_VAL;

