pnt325/efr32_mesh/btmesh_soc_vendor_server/sl_btmesh_data_logging_server.c
  // Reset transmission status
  sli_send_status = SL_BTMESH_DATA_LOG_IDLE;
  trans_count = 0;

  return st;
}

/***************************************************************************//**
 * De-Initialize the data log client.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_server_deinit(void)
{
  sli_send_count = SL_BTMESH_DATA_LOG_RESET_VAL;
  // Stop timers
  sl_sleeptimer_stop_timer(&sli_data_log_timeout_timer);
  sl_sleeptimer_stop_timer(&sli_data_log_sample_timer);
  sl_sleeptimer_stop_timer(&sli_data_log_periodic_timer);

  sli_log_started = false;
  is_sending_started = false;
  // De-Init vendor model
  return sl_btmesh_vendor_model_deinit(SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                                     SL_BTMESH_VENDOR_ID,
                                     SL_BTMESH_DATA_LOG_MODEL_SERVER_ID);
}

/***************************************************************************//**
 * Initialize the data log client.
 *
 * @param[in] frame Pointer to send package instance.
 * @param[in] len Length of the data to be sent.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t sli_btmesh_data_log_send(sl_data_frame_t *frame,
                                     sl_data_log_length_t len)
{
  sl_status_t st;

  if(len > SL_BTMESH_DATA_LOG_LENGTH_MAX){
      return SL_STATUS_INVALID_RANGE;
  }

  // Set the information log message
  st = sl_btmesh_vendor_model_set_publication(
                            SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                            SL_BTMESH_VENDOR_ID,
                            SL_BTMESH_DATA_LOG_MODEL_SERVER_ID,
                            SL_BTMESH_DATA_LOG_MESSAGE_STATUS_ID,
                            SL_BTMESH_SEGMENT_CONTI,
                            SL_BTMESH_DATA_LOG_INFO_LENGTH,
                            (const uint8_t *)&(frame->header.last));
  app_assert(st == SL_STATUS_OK,
                "[E: 0x%04x] Failed to set Log info publication\n",
                (int)st);

  if(SL_STATUS_OK == st){
    // Set the sending data log message
    st = sl_btmesh_vendor_model_set_publication(
                              SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                              SL_BTMESH_VENDOR_ID,
                              SL_BTMESH_DATA_LOG_MODEL_SERVER_ID,
                              SL_BTMESH_DATA_LOG_MESSAGE_STATUS_ID,
                              SL_BTMESH_SEGMENT_FINAL,
                              len,
                              (const uint8_t *)frame->data);
    app_assert(st == SL_STATUS_OK,
                  "[E: 0x%04x] Failed to set Log publication\n",
                  (int)st);

    // Send the log
    if(SL_STATUS_OK == st){
      st = sl_btmesh_vendor_model_publish(SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                                          SL_BTMESH_VENDOR_ID,
                                          SL_BTMESH_DATA_LOG_MODEL_SERVER_ID);
      app_assert(st == SL_STATUS_OK,
                  "[E: 0x%04x] Failed to send Log publication\n",
                  (int)st);
    }
  }

  return st;
}

/***************************************************************************//**
 * Start the sample rate timer and Log period timer.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_server_start(void)
{
  sl_status_t st;
  sl_btmesh_data_log_period_t period = 0;
  sl_btmesh_data_log_sample_rate_t rate = 0;

  if(!sli_log_started){
    if(is_storage_valid()){
        // Get the saved period value
        st = data_log_read_period(&period);
        if(SL_STATUS_OK != st){
            return st;
        }
        st = data_log_read_sample_rate(&rate);
        if(SL_STATUS_OK != st){
            return st;
        }
    }
    // Storage is not valid. Use the default value.
    if(0 == period){
      period = SL_BTMESH_DATA_LOG_PERIOD_MS_CFG_VAL;
    }
    if(0 == rate){
      rate = SL_BTMESH_DATA_LOG_SAMPLE_RATE_MS_CFG_VAL;
    }

    // Start periodic timer
    st = sl_sleeptimer_start_periodic_timer_ms(
                &sli_data_log_periodic_timer,
                (uint32_t)period,
                &sli_btmesh_data_log_periodic_callback,
                NO_CALLBACK_DATA,
                HIGH_PRIORITY,
                NO_FLAGS);

    if(SL_STATUS_OK != st){
        return st;
    }

    // Start sample timer
    st = sl_sleeptimer_start_periodic_timer_ms(
                &sli_data_log_sample_timer,
                (uint32_t)rate,
                &sli_btmesh_data_log_sample_callback,
                NO_CALLBACK_DATA,
                HIGH_PRIORITY,
                NO_FLAGS);

    if(SL_STATUS_OK != st){
        sli_log_started = true;
    }
  } else { return SL_STATUS_OK; }

  return st;
}

/***************************************************************************//**
 * Publish the current data.
 *
 * @param[in] data pointer to data to be sent.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_server_send_data(sl_data_log_data_t *data)
{
  sl_status_t st;
  // Set the sending data message
  st = sl_btmesh_vendor_model_set_publication(
                            SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                            SL_BTMESH_VENDOR_ID,
                            SL_BTMESH_DATA_LOG_MODEL_SERVER_ID,
                            SL_BTMESH_DATA_LOG_MESSAGE_TEMP_ID,
                            SL_BTMESH_SEGMENT_FINAL,
                            sizeof(sl_data_log_data_t),
                            (const uint8_t *)data);
  app_assert(st == SL_STATUS_OK,
                "[E: 0x%04x] Failed to set data publication\n",
                (int)st);

  // Send the log
  if(SL_STATUS_OK == st){
    st = sl_btmesh_vendor_model_publish(SL_BTMESH_DATA_LOG_ELEMENT_CFG_VAL,
                                        SL_BTMESH_VENDOR_ID,
                                        SL_BTMESH_DATA_LOG_MODEL_SERVER_ID);
    app_assert(st == SL_STATUS_OK,
                "[E: 0x%04x] Failed to publish data\n",
                (int)st);
  }

  return st;
}

/***************************************************************************//**
 * Start to publish the Log.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_server_send_status(void)
{
  sl_status_t st;
  sl_data_log_index_t idx = sli_data_log_inst.index;
  if(idx > 0){
      if (SL_BTMESH_DATA_LOG_BUSY == sli_send_status){
          st = SL_STATUS_BUSY;
      } else {
        // Calculate number of segment need to be sent
        sli_send_count = SL_BTMESH_DATA_LOG_SEG_NUM(idx);

        // Start sending
        st = sli_btmesh_data_log_send_handler();
        if(!is_sending_started){
            is_sending_started = true;
        }
      }
  } else {
      st = SL_STATUS_EMPTY;
      app_log("The Log is empty\r\n");
  } // The log is empty

  return st;
}

/***************************************************************************//**
 * Check the log sending is started.
 *
 * @return returns the log sending status.
 *         - true if log is requested to send
 *         - false if log is idle
 *
 ******************************************************************************/
bool sl_btmesh_data_log_is_started_sending(void)
{
  return is_sending_started;
}

/***************************************************************************//**
 * Process log sending.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_step(void)
{
  if(is_sending_started){
      return sli_btmesh_data_log_send_handler();
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Handle the packages sending.
 *
 * Start of sending, handler will trigger a timeout timer. Within the timeout,
 * if packages send completely, a callback function will be call. Otherwise,
 * a timeout occurs and the sending state will be reset.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sli_btmesh_data_log_send_handler(void)
{
  sl_status_t st;
  sl_data_log_length_t len;
  sl_data_frame_t data_frame;

