pnt325/efr32_mesh/btmesh_soc_vendor_server/sl_btmesh_data_logging_server.c
  if(sli_send_count > 0){
      if(SL_BTMESH_DATA_LOG_IDLE == sli_send_status){
          sli_send_status = SL_BTMESH_DATA_LOG_BUSY;
          // Start sending from the beginning of the log
          sli_send_index = SL_BTMESH_DATA_LOG_RESET_VAL;

          // Start timer
          st = sl_sleeptimer_start_timer_ms(&sli_data_log_timeout_timer,
                                      SL_BTMESH_DATA_LOG_TIMEOUT_MS_CFG_VAL,
                                      &sli_btmesh_data_log_timeout_callback,
                                      NO_CALLBACK_DATA,
                                      HIGH_PRIORITY,
                                      NO_FLAGS);
          if(SL_STATUS_OK != st){
              return st;
          }
      }
      if(sli_send_count > 1){
          len = SL_BTMESH_DATA_LOG_LENGTH_MAX
                * sizeof(sl_data_log_data_t);

          // Send segment
          data_frame.header.last = SL_BTMESH_DATA_LOG_NOT_LAST;
          data_frame.header.count = trans_count;
          data_frame.data = &(sli_data_log_inst.data[sli_send_index]);
          st = sli_btmesh_data_log_send(&data_frame, len);

          if(SL_STATUS_OK == st){
              // Point to the next segment
              sli_send_index += SL_BTMESH_DATA_LOG_LENGTH_MAX;
              sli_send_count--;
          } else { // Send failed
              // Reset transmission
              sli_send_count = SL_BTMESH_DATA_LOG_RESET_VAL;
              sli_send_status = SL_BTMESH_DATA_LOG_IDLE;
              is_sending_started = false;
              app_log("Failed to send Log\r\n");
              return st;
          }
      } else { // (sli_send_count == 1) Last segment
          len = (sli_data_log_inst.index - sli_send_index)
                * sizeof(sl_data_log_data_t);
          // Send the last segment
          data_frame.header.last = SL_BTMESH_DATA_LOG_LAST;
          data_frame.header.count = trans_count;
          data_frame.data = &(sli_data_log_inst.data[sli_send_index]);
          st = sli_btmesh_data_log_send(&data_frame, len);
          if(SL_STATUS_OK == st){
              sli_send_count--;
          } else { // Send fail
              // Reset transmission
              sli_send_count = SL_BTMESH_DATA_LOG_RESET_VAL;
              sli_send_status = SL_BTMESH_DATA_LOG_IDLE;
              is_sending_started = false;
              app_log("Failed to send last Log\r\n");
              return st;
          }
      }
  } else if(SL_BTMESH_DATA_LOG_BUSY == sli_send_status){
      // Reset log
      sli_data_log_inst.index = SL_BTMESH_DATA_LOG_RESET_VAL;
      sli_send_status = SL_BTMESH_DATA_LOG_IDLE;
      is_sending_started = false;
      sl_sleeptimer_stop_timer(&sli_data_log_timeout_timer);
      // Execute complete callback
      sl_btmesh_data_log_complete_callback();
      // Next sending ID
      trans_count++;
      st = SL_STATUS_OK;
  } else { st = SL_STATUS_OK; }

  return st;
}

/***************************************************************************//**
 * Append new data to the Log.
 *
 * @param[in] data Data value to be appended to the Log.
 *
 * If the Log is full then a full callback is executed.
 * If the Log is overflow then a overflow callback is executed.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_append(sl_data_log_data_t *data)
{
  sl_data_log_data_t *ret_ptr;
  sl_data_log_index_t idx;

  // Check if the log is sanding
  if(SL_BTMESH_DATA_LOG_BUSY == sli_send_status){
      return SL_STATUS_BUSY;
  }
  idx = sli_data_log_inst.index;
  if(idx < SL_BTMESH_DATA_LOG_BUFF_SIZE_CFG_VAL) {
    ret_ptr = (sl_data_log_data_t *)memcpy((sl_data_log_data_t *)&(sli_data_log_inst.data[idx]),
                                           (sl_data_log_data_t *)data,
                                           sizeof(sl_data_log_data_t));
    if(NULL == ret_ptr) {
      return SL_STATUS_FAIL;
    }
  }

  if(idx < (SL_BTMESH_DATA_LOG_BUFF_SIZE_CFG_VAL - 1)) {
      sli_data_log_inst.index++;
      return SL_STATUS_OK;
  } else if(idx == (SL_BTMESH_DATA_LOG_BUFF_SIZE_CFG_VAL - 1)) {
      // Execute full callback function
      sl_btmesh_data_log_full_callback();
      sli_data_log_inst.index++;
      return SL_STATUS_FULL;
  } else {
      // Execute overflow callback function
      app_log("The log exceeds limit!");
      sl_btmesh_data_log_ovf_callback();
  }

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * Reset the Log.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_reset(void)
{
  if(SL_BTMESH_DATA_LOG_IDLE == sli_send_status){
      sli_data_log_inst.index = SL_BTMESH_DATA_LOG_RESET_VAL;
  } else {
      return SL_STATUS_BUSY;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get the current status of the Log.
 *
 * @return Return the current status of the Log.
 *  - SL_BTMESH_DATA_LOG_IDLE if Log is idle.
 *  - SL_BTMESH_DATA_LOG_BUSY if Log is receiving.
 *
 ******************************************************************************/
uint8_t sl_btmesh_data_log_get_server_state(void)
{
  return sli_send_status;
}

/***************************************************************************//**
 * Handle event of the Log server.
 *
 * @param[in] evt Pointer to btmesh message.
 *
 * Handle event of the Vendor model. If there's valid opcode received then
 * receiving handler will be called for:
 * - Log received response.
 * - Set period request.
 * - Set sample rate request.
 * - Set threshold request.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 *  @note This function must be executed in sl_btmesh_on_event for the
 *  sl_btmesh_evt_vendor_model_receive_id event.
 ******************************************************************************/
sl_status_t sl_btmesh_data_log_on_server_receive_event(sl_btmesh_msg_t *evt)
{
  sl_status_t st;
  sl_btmesh_evt_vendor_model_receive_t *log_evt =
          &(evt->data.evt_vendor_model_receive);

