pnt325/efr32_mesh/btmesh_soc_vendor_server/sl_btmesh_data_logging_server.c
  app_log("OPCODE: %02x\r\n", log_evt->opcode);
  switch(log_evt->opcode)
  {
// #if defined(SL_BTMESH_DATA_LOG_RSP_ENABLE)
    case SL_BTMESH_DATA_LOG_MESSAGE_STATUS_RSP_ID:
      st = sli_btmesh_data_log_send_handler();
      break;
// #endif
    case SL_BTMESH_DATA_LOG_MESSAGE_PERIOD_ID:
      st = sli_btmesh_data_log_update_period(log_evt);
      break;
    case SL_BTMESH_DATA_LOG_MESSAGE_SAMPLE_RATE_ID:
      st = sli_btmesh_data_log_update_sample_rate(log_evt);
      break;
    case SL_BTMESH_DATA_LOG_MESSAGE_THRESHOLD_ID:
      st = sli_btmesh_data_log_update_threshold(log_evt);
      break;
    case SL_BTMESH_DATA_LOG_MESSAGE_STATUS_ID:
    	st = SL_STATUS_OK;
    	break;
    default: st = SL_STATUS_FAIL;
  }

  return st;
}

/***************************************************************************//**
 * Timeout timer callback function.
 *
 ******************************************************************************/
static void sli_btmesh_data_log_timeout_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data)
{
  (void)handle;
  (void)data;

  // Transmission timeout
  if(SL_BTMESH_DATA_LOG_BUSY == sli_send_status){
      sli_send_count = SL_BTMESH_DATA_LOG_RESET_VAL;
      sli_send_status = SL_BTMESH_DATA_LOG_IDLE;
      is_sending_started = false;
      app_log("Log sent timeout!\r\n");
  }
}

/***************************************************************************//**
 * Sample timer callback function.
 *
 ******************************************************************************/
static void sli_btmesh_data_log_sample_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data)
{
  (void)handle;
  (void)data;

  sl_btmesh_data_log_on_sample_callback();
}

/***************************************************************************//**
 * Periodic Log timer callback function.
 *
 ******************************************************************************/
static void sli_btmesh_data_log_periodic_callback(
            sl_sleeptimer_timer_handle_t *handle,
            void *data)
{
  (void)handle;
  (void)data;
  sl_btmesh_data_log_on_periodic_callback();
}

/***************************************************************************//**
 * Update period requested by client.
 *
 * @param[in] evt Pointer to btmesh Vendor model message.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t sli_btmesh_data_log_update_period(
                sl_btmesh_evt_vendor_model_receive_t *evt)
{
  sl_status_t st;
  sl_btmesh_data_log_period_t period;
  memcpy((uint8_t *)&period,
         (uint8_t *)evt->payload.data,
         sizeof(sl_btmesh_data_log_period_t));

  st = data_log_save_period(period);

  if(sli_log_started){
    // Re-Start periodic timer
    st = sl_sleeptimer_restart_periodic_timer_ms(
                &sli_data_log_periodic_timer,
                period,
                &sli_btmesh_data_log_periodic_callback,
                NO_CALLBACK_DATA,
                HIGH_PRIORITY,
                NO_FLAGS);

    if(SL_STATUS_OK == st){
        app_log("Period is updated: %d\r\n",
                   period);
    }
  }
  return st;
}

/***************************************************************************//**
 * Update sample rate requested by client.
 *
 * @param[in] evt Pointer to btmesh Vendor model message.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t sli_btmesh_data_log_update_sample_rate(
                sl_btmesh_evt_vendor_model_receive_t *evt)
{
  sl_status_t st;
  sl_btmesh_data_log_sample_rate_t rate;

  memcpy((uint8_t *)&rate,
         (uint8_t *)evt->payload.data,
         sizeof(sl_btmesh_data_log_sample_rate_t));

  st = data_log_save_sample_rate(rate);

  if(sli_log_started){
    // Re-Start sample timer
    st = sl_sleeptimer_restart_periodic_timer_ms(
                &sli_data_log_sample_timer,
                rate,
                &sli_btmesh_data_log_sample_callback,
                NO_CALLBACK_DATA,
                HIGH_PRIORITY,
                NO_FLAGS);

    if(SL_STATUS_OK == st){
        app_log("Sample rate is updated: %d\r\n", rate);
    }
  }
  return st;
}

/***************************************************************************//**
 * Update threshold requested by client.
 *
 * @param[in] evt Pointer to btmesh Vendor model message.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t sli_btmesh_data_log_update_threshold(
                sl_btmesh_evt_vendor_model_receive_t *evt)
{
  sl_status_t st;
  sl_btmesh_data_log_threshold_t threshold;

  if(NULL != memcpy((uint8_t *)&threshold,
                    (uint8_t *)evt->payload.data,
                    sizeof(sl_btmesh_data_log_threshold_t)))
  {
    st = data_log_save_threshold(threshold);
    app_log("Threshold is updated: %d\r\n", threshold);
    return st;
  } else { return SL_STATUS_FAIL; }
}

/***************************************************************************//**
 * Get the threshold value.
 *
 * @return returns the current threshold value.
 *
 ******************************************************************************/
sl_btmesh_data_log_threshold_t sl_btmesh_data_log_get_threshold(void)
{
  sl_btmesh_data_log_threshold_t threshold = 0;
  (void)data_log_read_threshold(&threshold);
  return threshold;
}

/***************************************************************************//**
 * Store the period value to the NVM.
 *
 * @param[in] period log period value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_save_period(sl_btmesh_data_log_period_t period)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  // Read properties
  ec = data_log_read_properties(&properties);

  if(ECODE_NVM3_OK == ec){
      properties.period = period;
      // Write back to NVM
      ec = data_log_write_properties(&properties);
      if(ECODE_NVM3_OK != ec){
          app_log("Failed to save period: 0x%08x\r\n", ec);
          return SL_STATUS_FAIL;
      }
  } else {
      app_log("Failed to save period: 0x%08x\r\n", ec);
      return SL_STATUS_FAIL;
  }

