pnt325/efr32_mesh/btmesh_soc_vendor_server/sl_btmesh_data_logging_server.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Store the sample rate value to the NVM.
 *
 * @param[in] rate sample rate value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_save_sample_rate(
                      sl_btmesh_data_log_sample_rate_t rate)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  // Read properties
  ec = data_log_read_properties(&properties);

  if(ECODE_NVM3_OK == ec){
      properties.sample_rate = rate;
      // Write back to NVM
      ec = data_log_write_properties(&properties);
      if(ECODE_NVM3_OK != ec){
          app_log("Failed to save sample rate: 0x%08x\r\n", ec);
          return SL_STATUS_FAIL;
      }
  } else {
      app_log("Failed to save sample rate: 0x%08x\r\n", ec);
      return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Store the threshold value to the NVM.
 *
 * @param[in] threshold threshold rate value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_save_threshold(
                      sl_btmesh_data_log_threshold_t threshold)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  // Read properties
  ec = data_log_read_properties(&properties);

  if(ECODE_NVM3_OK == ec){
      properties.threshold = threshold;
      // Write back to NVM
      ec = data_log_write_properties(&properties);
      if(ECODE_NVM3_OK != ec){
          app_log("Failed to save threshold: 0x%08x\r\n", ec);
          return SL_STATUS_FAIL;
      }
  } else {
      app_log("Failed to save threshold: 0x%08x\r\n", ec);
      return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Read the period value from the NVM.
 *
 * @param[out] period log period value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_read_period(sl_btmesh_data_log_period_t *period)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  ec = data_log_read_properties(&properties);
  if(ECODE_NVM3_OK == ec){
      *period = properties.period;
      return SL_STATUS_OK;
  } else {
     app_log("Failed to read period: 0x%08x", ec);
  }

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * Read the sample rate value from the NVM.
 *
 * @param[out] rate log sample rate value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_read_sample_rate(
                      sl_btmesh_data_log_sample_rate_t *rate)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  ec = data_log_read_properties(&properties);
  if(ECODE_NVM3_OK == ec){
      *rate = properties.sample_rate;
      return SL_STATUS_OK;
  } else {
     app_log("Failed to read sample rate: 0x%08x", ec);
  }

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * Read the threshold value from the NVM.
 *
 * @param[out] threshold threshold value.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
static sl_status_t data_log_read_threshold(
                      sl_btmesh_data_log_threshold_t *threshold)
{
  Ecode_t ec;
  sl_btmesh_data_log_properties_t properties;

  ec = data_log_read_properties(&properties);
  if(ECODE_NVM3_OK == ec){
      *threshold = properties.threshold;
      return SL_STATUS_OK;
  } else {
     app_log("Failed to read threshold: 0x%08x", ec);
  }

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * Read the properties structure from the NVM.
 *
 * @param[out] properties pointer to data log properties.
 *
 * @return ECODE_NVM3_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
__STATIC_INLINE Ecode_t data_log_read_properties(
                      sl_btmesh_data_log_properties_t *properties)
{
  return nvm3_readData(nvm3_defaultHandle,
                       SLI_BTMESH_NVM3_DATA_LOG_PROP_KEY,
                       (sl_btmesh_data_log_properties_t *)properties,
                       sizeof(sl_btmesh_data_log_properties_t));
}

/***************************************************************************//**
 * Write the properties structure from the NVM.
 *
 * @param[in] properties pointer to data log properties.
 *
 * @return ECODE_NVM3_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
__STATIC_INLINE Ecode_t data_log_write_properties(
                      sl_btmesh_data_log_properties_t *properties)
{
  return nvm3_writeData(nvm3_defaultHandle,
                       SLI_BTMESH_NVM3_DATA_LOG_PROP_KEY,
                       (sl_btmesh_data_log_properties_t *)properties,
                       sizeof(sl_btmesh_data_log_properties_t));
}

/***************************************************************************//**
 * Check the Data Log object valid or not
 *
 * @return returns the valid status.
 *                 - true if the object key is valid
 *                 - false if the object key is invalid
 *
 ******************************************************************************/
static bool is_storage_valid(void)
{
  uint32_t type;
  size_t len;
  Ecode_t ec = nvm3_getObjectInfo(nvm3_defaultHandle,
                          SLI_BTMESH_NVM3_DATA_LOG_PROP_KEY,
                          &type,
                          &len);
  if((ECODE_NVM3_OK == ec) && (NVM3_OBJECTTYPE_DATA == type)){
      return true;
  } else { return false; }
}

/***************************************************************************//**
 * Delete NVM storage.
 *
 ******************************************************************************/
void sl_btmesh_data_log_reset_config(void)
{
  if(is_storage_valid()){
      (void)nvm3_deleteObject(nvm3_defaultHandle,
                              SLI_BTMESH_NVM3_DATA_LOG_PROP_KEY);
  }
}

/***************************************************************************//**
 * Weak implementation of Callbacks.
 *
 ******************************************************************************/
SL_WEAK void sl_btmesh_data_log_full_callback(void)
{

}

SL_WEAK void sl_btmesh_data_log_ovf_callback(void)
{

}

SL_WEAK void sl_btmesh_data_log_complete_callback(void)
{

}

SL_WEAK void sl_btmesh_data_log_on_sample_callback(void)
{

}

SL_WEAK void sl_btmesh_data_log_on_periodic_callback(void)
{

}

#ifdef __cplusplus
}
#endif
